In [4]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

- code is changed
- git session is started in 15-feb-2025

In [1]:
# create a data with 
# name 
# city 
# age
# each column as 4 values
# each column we will miss one value

In [10]:
dict={'name':['shiva','shashi','kumar',None],
                             'age':[20,None,22,23],
                                    'city':[None,'hyd','pune','jgl']}
dict

{'name': ['shiva', 'shashi', 'kumar', None],
 'age': [20, None, 22, 23],
 'city': [None, 'hyd', 'pune', 'jgl']}

In [12]:
dict={'name':['shiva','shashi','kumar',None],
                             'age':[20,None,22,23],
                                    'city':[None,'hyd','pune','jgl']
     }
data=pd.DataFrame(dict)
data

     name   age  city
0   shiva  20.0  None
1  shashi   NaN   hyd
2   kumar  22.0  pune
3    None  23.0   jgl

- while creating we provide None
- but by default the dataframe adjudst the data type

In [13]:
dict={'name':['shiva','shashi','kumar',None],
                             'age':[20,None,22,23],
                                    'city':[None,'hyd','pune','jgl']
     }
data=pd.DataFrame(dict)
data.to_csv('dict.csv',index=False)

In [14]:
# we have to import the package numpy
import numpy as np

In [15]:
dict2={'name':['shiva','shashi','kumar',np.nan],
                             'age':[20,np.nan,22,23],
                                    'city':[np.nan,'hyd','pune','jgl']
     }
data1=pd.DataFrame(dict2)
data1

     name   age  city
0   shiva  20.0   NaN
1  shashi   NaN   hyd
2   kumar  22.0  pune
3     NaN  23.0   jgl

In [16]:
dict2={'name':['shiva','shashi','kumar',np.nan],
                             'age':[20,np.nan,22,23],
                                    'city':[np.nan,'hyd','pune','jgl']
     }
data1=pd.DataFrame(dict2)
data1.to_csv('dict1.csv',index=False)

In [17]:
# while checking  both saved data's are same in the local folders

In [18]:
data1.isnull()

    name    age   city
0  False  False   True
1  False   True  False
2  False  False  False
3   True  False  False

In [19]:
data1.isnull().sum()

name    1
age     1
city    1
dtype: int64

In [20]:
# the meaning of above is each column and row the one(1) data is missing

In [22]:
data1.fillna(25)

     name   age  city
0   shiva  20.0    25
1  shashi  25.0   hyd
2   kumar  22.0  pune
3      25  23.0   jgl

In [ ]:
# the none columns will be filled with the given argument =25

In [25]:
data1['name'].fillna('abhi')

0     shiva
1    shashi
2     kumar
3      abhi
Name: name, dtype: object

- pad 
- ffill
- backfill
- bfill
- donot give any value,only provide the method='pad'

In [32]:
data1.fillna(method='pad')

C:\Users\Kolag\AppData\Local\Temp\ipykernel_5740\116358274.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data1.fillna(method='pad')

     name   age  city
0   shiva  20.0   NaN
1  shashi  20.0   hyd
2   kumar  22.0  pune
3   kumar  23.0   jgl

In [ ]:
# while we getting warning
# we have to follow below

In [34]:
import warnings
warnings.filterwarnings('ignore')
data1.fillna(method='pad')

     name   age  city
0   shiva  20.0   NaN
1  shashi  20.0   hyd
2   kumar  22.0  pune
3   kumar  23.0   jgl

In [35]:
data1

     name   age  city
0   shiva  20.0   NaN
1  shashi   NaN   hyd
2   kumar  22.0  pune
3     NaN  23.0   jgl

In [36]:
data1.fillna(method='ffill')

     name   age  city
0   shiva  20.0   NaN
1  shashi  20.0   hyd
2   kumar  22.0  pune
3   kumar  23.0   jgl

In [37]:
data1.fillna(method='backfill')

     name   age  city
0   shiva  20.0   hyd
1  shashi  22.0   hyd
2   kumar  22.0  pune
3     NaN  23.0   jgl

In [38]:
data1.fillna(method='bfill')

     name   age  city
0   shiva  20.0   hyd
1  shashi  22.0   hyd
2   kumar  22.0  pune
3     NaN  23.0   jgl

In [ ]:
# bfill and backfill are same 
# pad and ffill are same

In [39]:
data1.fillna(method='bfill',axis=0)

     name   age  city
0   shiva  20.0   hyd
1  shashi  22.0   hyd
2   kumar  22.0  pune
3     NaN  23.0   jgl

In [40]:
data1.fillna(method='bfill',axis=1)

     name   age  city
0   shiva  20.0   NaN
1  shashi   hyd   hyd
2   kumar  22.0  pune
3    23.0  23.0   jgl

In [41]:
data1.fillna(method='backfill',axis=0)

     name   age  city
0   shiva  20.0   hyd
1  shashi  22.0   hyd
2   kumar  22.0  pune
3     NaN  23.0   jgl

In [42]:
data1.fillna(method='backfill',axis=1)

     name   age  city
0   shiva  20.0   NaN
1  shashi   hyd   hyd
2   kumar  22.0  pune
3    23.0  23.0   jgl

In [43]:
data1.fillna(method='ffill',axis=0)

     name   age  city
0   shiva  20.0   NaN
1  shashi  20.0   hyd
2   kumar  22.0  pune
3   kumar  23.0   jgl

In [46]:
data1.fillna(method='ffill',axis=1)

     name     age  city
0   shiva    20.0  20.0
1  shashi  shashi   hyd
2   kumar    22.0  pune
3     NaN    23.0   jgl

In [47]:
data1.fillna(method='pad',axis=0)

     name   age  city
0   shiva  20.0   NaN
1  shashi  20.0   hyd
2   kumar  22.0  pune
3   kumar  23.0   jgl

In [48]:
data1.fillna(method='pad',axis=1)

     name     age  city
0   shiva    20.0  20.0
1  shashi  shashi   hyd
2   kumar    22.0  pune
3     NaN    23.0   jgl

# mean-median-mode

In [49]:
# first choose the column
# if it is numerical column then fill with mean or median
# if it is categorical column then fill with mode

In [50]:
data1

     name   age  city
0   shiva  20.0   NaN
1  shashi   NaN   hyd
2   kumar  22.0  pune
3     NaN  23.0   jgl

In [54]:
mean_age=data['age'].mean()
data['age'].fillna(mean_age)

0    20.000000
1    21.666667
2    22.000000
3    23.000000
Name: age, dtype: float64

In [55]:
median_age=data['age'].median()
data['age'].fillna(median_age)

0    20.0
1    22.0
2    22.0
3    23.0
Name: age, dtype: float64

In [63]:
median_age

22.0

In [ ]:
mode.values[0]

In [69]:
mean_age=data['age'].mean()
data['age'].fillna(mean_age)

0    20.000000
1    21.666667
2    22.000000
3    23.000000
Name: age, dtype: float64

In [68]:
median_age=data['age'].median()
data['age'].fillna(median_age)

0    20.0
1    22.0
2    22.0
3    23.0
Name: age, dtype: float64

In [67]:
mode=data['city'].mode()
data['city'].fillna(mode.values[0])

0     hyd
1     hyd
2    pune
3     jgl
Name: city, dtype: object

- random
- pad
- ffill
- bfill
- backfill
- mean
- median
- mode

- missing value analysis  will be done before outliers only 
- either we can fill with median
- do not take all the data mean
- we will take only some sample means **KNN Imputer**

**KNN Imputer**
- KNN means K-nearest neighbours
- we will choose the less distance people

In [ ]:
# packagename=sklearn
# classname= Imputer
# methodname=KNNImputer
# steps
# read the method
# save the method
# apply the fit transform

from sklearn.impute import KNNIputer
knn=KNNImputer()
knn